snlkuharlocal/src/Documents/РезервированиеШК/РезервированиеШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезервированиеШК</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РезервныеШК</name>
    <attributes>
      <name>ШК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/РезервированиеШКGS1/РезервированиеШКGS1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезервированиеШКGS1</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУстановки</name>
    <type>
      <types>DocumentRef.УстановкаШКGS1</types>
    </type>
  </attributes>
  <dimensions>
    <name>GS1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.РезервированиеШК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Присвоен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/РезервированиеШК/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.	
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	НадоПерезаписыватьСкидки	= Ложь;
	ЕстьИзменения				= Модифицированность();
	//
	//Если НЕ ОбменДанными.Загрузка Тогда
	//	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
	//	МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
	//	
	//	Если Отказ Тогда Возврат КонецЕсли; 	
	//КонецЕсли;		
	//
	//УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	НаборЗаписей = РегистрыСведений.РезервированиеШКGS1.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.документРегистрации.Установить(ЭтотОбъект.ссылка); 
	
	Ошибка = 0;
	
	Для каждого Текстрока из РезервныеШК цикл
		
	
		УжеЕсть = ПроверкаШКGS1НаИспользование(ТЕкСтрока.ШК) ;
	
		
		Если УжеЕсть тогда
			//сообщить("Проведение отменено");
		Иначе
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.ДокументРегистрации = ЭтотОбъект.ссылка; 
			НоваяЗапись.GS1 = ТЕкСтрока.ШК;
			             //GS1
		КонецЕсли;
		
	КонецЦикла; 
	Если НЕ ошибка Тогда
		НаборЗаписей.Записать(); 
	иначе
		Отказ=истина;
		#если клиент тогда
			сообщить("Проведение отменено");
		#конецесли
	конецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// сделать проверку, что ШК еще не использовали. иначе не распроводить????
	
	НаборЗаписей = РегистрыСведений.РезервированиеШКGS1.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.документРегистрации.Установить(ЭтотОбъект.ссылка); 
	Наборзаписей.Записать();
	Ошибка = 0;

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	резервныеШк.Очистить();
	
КонецПроцедуры
